In [1]:
import pandas as pd
df = pd.read_csv('titanic.csv')
df.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

In [28]:
df.shape

(891, 5)

In [2]:
df.drop(['PassengerId','Name','SibSp','Parch','Ticket','Cabin','Embarked'],axis =1,inplace=True)
df.head()

   Survived  Pclass     Sex   Age     Fare
0         0       3    male  22.0   7.2500
1         1       1  female  38.0  71.2833
2         1       3  female  26.0   7.9250
3         1       1  female  35.0  53.1000
4         0       3    male  35.0   8.0500

In [4]:
target =df.Survived
inputs = df.drop('Survived',axis='columns')

In [5]:
dummies = pd.get_dummies(inputs.Sex)
dummies.head()

   female  male
0       0     1
1       1     0
2       1     0
3       1     0
4       0     1

In [9]:
inputs = pd.concat([inputs,dummies],axis ='columns')
inputs.head()

   Pclass     Sex   Age     Fare  female  male
0       3    male  22.0   7.2500       0     1
1       1  female  38.0  71.2833       1     0
2       3  female  26.0   7.9250       1     0
3       1  female  35.0  53.1000       1     0
4       3    male  35.0   8.0500       0     1

In [10]:
inputs.drop('Sex',axis=1,inplace = True)
inputs.head()

   Pclass   Age     Fare  female  male
0       3  22.0   7.2500       0     1
1       1  38.0  71.2833       1     0
2       3  26.0   7.9250       1     0
3       1  35.0  53.1000       1     0
4       3  35.0   8.0500       0     1

In [12]:
inputs.isnull().sum()

Pclass      0
Age       177
Fare        0
female      0
male        0
dtype: int64

In [14]:
inputs.Age[:10]

0    22.0
1    38.0
2    26.0
3    35.0
4    35.0
5     NaN
6    54.0
7     2.0
8    27.0
9    14.0
Name: Age, dtype: float64

In [19]:
mean=inputs.Age.mean()
mean

29.699117647058763

In [21]:
inputs.Age =inputs.Age.fillna(mean)
inputs.head(6)

   Pclass        Age     Fare  female  male
0       3  22.000000   7.2500       0     1
1       1  38.000000  71.2833       1     0
2       3  26.000000   7.9250       1     0
3       1  35.000000  53.1000       1     0
4       3  35.000000   8.0500       0     1
5       3  29.699118   8.4583       0     1

In [23]:
from sklearn.model_selection import train_test_split
X_train,X_test,y_train,y_test = train_test_split(inputs,target,test_size=0.2)

In [24]:
len(X_train)

712

In [25]:
len(X_test)

179

In [26]:
len(inputs)

891

In [30]:
from sklearn.naive_bayes import GaussianNB
model = GaussianNB()

In [31]:
model.fit(X_train,y_train)

GaussianNB()

In [32]:
model.score(X_test,y_test)

0.7932960893854749

In [33]:
X_test[:10]

     Pclass        Age     Fare  female  male
165       3   9.000000  20.5250       0     1
843       3  34.500000   6.4375       0     1
711       1  29.699118  26.5500       0     1
447       1  34.000000  26.5500       0     1
857       1  51.000000  26.5500       0     1
73        3  26.000000  14.4542       0     1
351       1  29.699118  35.0000       0     1
674       2  29.699118   0.0000       0     1
167       3  45.000000  27.9000       1     0
470       3  29.699118   7.2500       0     1

In [34]:
y_test[:10]

165    1
843    0
711    0
447    1
857    1
73     0
351    0
674    0
167    0
470    0
Name: Survived, dtype: int64

In [35]:
model.predict(X_test[:10])

array([0, 0, 0, 0, 0, 0, 0, 0, 1, 0], dtype=int64)

In [36]:
model.predict_proba(X_test[:10])

array([[0.98489274, 0.01510726],
       [0.99013918, 0.00986082],
       [0.92015008, 0.07984992],
       [0.92099835, 0.07900165],
       [0.90345029, 0.09654971],
       [0.98996438, 0.01003562],
       [0.91315943, 0.08684057],
       [0.97655392, 0.02344608],
       [0.07898615, 0.92101385],
       [0.99007423, 0.00992577]])